app/controllers/acompanamientos_controller.rb

SELECT "acompanamientos".* FROM "acompanamientos"
---
  def index
    @acompanamientos = Acompanamiento.all

INSERT INTO "acompanamientos" ("acompanamientos", "dia", "semana", "soda_id") VALUES (?, ?, ?, ?)  [["acompanamientos", "fresco de tomate de arbol"], ["dia", 1], ["semana", 1], ["soda_id", 1]]
---
  def create
    @acompanamiento = Acompanamiento.new(acompanamiento_params)

    if @acompanamiento.save