app/controllers/comentarios_controller.rb

SELECT "comentarios".* FROM "comentarios"
---
  def index
    @comentarios = Comentario.all

SELECT  "comentarios".* FROM "comentarios"  WHERE "comentarios"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @comentario = Comentario.find(params[:id])

SELECT "comentarios".* FROM "comentarios"  WHERE (plato_id = '1' and usuario_id = '1')
INSERT INTO "comentarios" ("comentario", "created_at", "plato_id", "puntos", "updated_at", "usuario_id") VALUES (?, ?, ?, ?, ?, ?)  [["comentario", "bueno"], ["created_at", "2014-11-18 21:12:28.306315"], ["plato_id", 1], ["puntos", 5], ["updated_at", "2014-11-18 21:12:28.306315"], ["usuario_id", 1]]
---
  def create


    if params[:busq] # CONSULTA PARA REVISAR SI YA EXISTE UN COMENTARIO

    @comentario = Comentario.where("plato_id = ? and usuario_id = ?", params[:plato_id], params[:usuario_id])

    render json: @comentario.as_json(only: [:id, :comentario, :puntos, :plato_id, :usuario_id])

    else
      @comentario = Comentario.new(comentario_params)

      if @comentario.save

SELECT  "comentarios".* FROM "comentarios"  WHERE "comentarios"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "comentarios" SET "comentario" = ?, "puntos" = ?, "updated_at" = ? WHERE "comentarios"."id" = 1  [["comentario", "buenisimo"], ["puntos", 10], ["updated_at", "2014-11-18 21:25:21.939547"]]
---
  def update
    @comentario = Comentario.find(params[:id])

    if @comentario.update(comentario_params)