app/controllers/platos_controller.rb

  def index
    @platos = Plato.all
---
SELECT "platos".* FROM "platos"

  def show
    @plato = Plato.find(params[:id])

    if !@plato.comentario.first.nil?
---
SELECT  "platos".* FROM "platos"  WHERE "platos"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "comentarios".* FROM "comentarios"  WHERE "comentarios"."plato_id" = ?  ORDER BY "comentarios"."id" ASC LIMIT 1  [["plato_id", 1]]

  def create
    if params[:best]
      @plato = Plato.where("dia = ? and semana = ?", params[:dia], params[:semana])
      #@plato.order(:promedio)

      @recomendacion = @plato.order(promedio: :desc).first

      render json: @recomendacion.as_json(only: [:id, :nombre, :precio, :categoria, :calificaciones, :total, :soda_id, :promedio])

    else
      if params[:get]
        @plato = Plato.where("soda_id = ? and dia = ? and semana = ?", params[:soda_id], params[:dia], params[:semana])

        render json: @plato.as_json(only: [:id, :nombre, :precio, :categoria, :tipo, :calificaciones, :total, :semana, :dia, :soda_id, :promedio])


      else
        @plato = Plato.new(plato_params)

        if @plato.save
---
SELECT "platos".* FROM "platos"  WHERE (soda_id = '11' and dia = NULL and semana = NULL)
SELECT  "platos".* FROM "platos"  WHERE "platos"."id" = ? LIMIT 1  [["id", 6]]
INSERT INTO "platos" ("calificaciones", "created_at", "promedio", "total", "updated_at") VALUES (?, ?, ?, ?, ?)  [["calificaciones", 0], ["created_at", "2014-11-11 20:27:41.644324"], ["promedio", 0.0], ["total", 0], ["updated_at", "2014-11-11 20:27:41.644324"]]
UPDATE "platos" SET "calificaciones" = ?, "promedio" = ?, "total" = ?, "updated_at" = ? WHERE "platos"."id" = 1  [["calificaciones", 5], ["promedio", 4.0], ["total", 20], ["updated_at", "2014-11-02 01:52:10.965980"]]