app/controllers/snacks_controller.rb

SELECT "snacks".* FROM "snacks"  WHERE (soda_id = '11')
INSERT INTO "snacks" ("created_at", "soda_id", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-10-27 23:04:40.083981"], ["soda_id", 11], ["updated_at", "2014-10-27 23:04:40.083981"]]
---
  def create
    if params[:get]
      @snack = Snack.where("soda_id = ?", params[:soda_id])

      render json: @snack.as_json(only: [:id, :nombre, :precio, :soda_id])

    else
      @snack = Snack.new(snack_params)

      if @snack.save