app/controllers/usuarios_controller.rb

SELECT  "usuarios".* FROM "usuarios"  WHERE "usuarios"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "comentarios".* FROM "comentarios"  WHERE "comentarios"."usuario_id" = ?  ORDER BY "comentarios"."id" ASC LIMIT 1  [["usuario_id", 1]]
---
  def show
    @usuario = Usuario.find(params[:id])

    if !@usuario.comentario.first.nil?

DELETE FROM "usuarios" WHERE "usuarios"."direccion" = 'a@a.com'
SELECT "usuarios".* FROM "usuarios"  WHERE (direccion = 'a@a.com')
INSERT INTO "usuarios" ("created_at", "direccion", "nombre", "password", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-11-14 04:18:12.366876"], ["direccion", "b@b.com"], ["nombre", "Fede"], ["password", "lavaca"], ["updated_at", "2014-11-14 04:18:12.366876"]]
---
  def create

    if params[:dest]

      Usuario.delete_all(:direccion => params[:direccion])

      head :no_content


    else

      if params[:opt]

        @usuario = Usuario.where("direccion = ?", params[:direccion])

        render json: @usuario.as_json(only: [:id, :direccion, :password])

      else
        @usuario = Usuario.new(usuario_params)

        if @usuario.save